{
  "title": "Startups I've Helped Develop",
  "companies": [
    {
      "id": "sociala-verktygsladan",
      "name": "Sociala verktygslådan",
      "title": "UX Consultant",
      "duration": "June 2025 – Present",
      "shortDescription": "Improving user experience for an informal website aimed at social workers, families, and children.",
      "fullDescription": [
        "Responsible for enhancing the usability and accessibility of the company’s informal website.",
        "Focused on creating an intuitive and engaging interface to encourage visitors to stay longer, which positively impacts SEO.",
        "Tailored the site’s structure, navigation, and tone to meet the needs of both professional users (social workers) and non-professional users (families and children).",
        "Worked on SEO improvements to increase visibility and ensure content reaches the right audience.",
        "This role is limited to the website and does not involve the company’s app or core product."
      ],
      "url": "https://socialaverktygsladan.se/"
    },
    {
      "id": "Hantverkskollen",
      "name": "Hantverkskollen",
      "title": "Consultant",
      "duration": "June 2025 – Present",
      "shortDescription": "Supporting research and discovery for digital solutions within the construction and contractor industry.",
      "fullDescription": [
        "As a consultant, my current role involves helping the startup explore and understand the needs of craftsmen and contractors in Sweden.",
        "The work is in an early stage where we're gathering insights through market research to identify pain points in the industry.",
        "One of the most likely outcomes is building a booking or communication system between customers and craftsmen—especially since many professionals prefer not to take phone calls while working.",
        "The exact product direction is still undecided, as it will be shaped by ongoing research and user feedback.",
        "My contributions will adapt depending on the results, but I’m involved from a technical and strategic perspective to guide the development of a meaningful digital solution."
      ],
      "url": "https://hantverkskollen.se/"
    },
    {
      "id": "Juke",
      "name": "Juke",
      "title": "Fullstack Developer",
      "duration": "June 2025 - Present",
      "shortDescription": "Developing a system that allows customers to queue songs via a web application in pubs and bars.",
      "fullDescription": [
        "I am responsible for further developing a product that connects the web app to the bars’ Spotify accounts to enable song queuing directly in the bar’s music system.",
        "The system aims to increase sales and customer dwell time by allowing them to influence the music selection via their mobile devices or computers.",
        "Bars will be able to set filters and control the music played, for example, through themed days where only specific genres or decades, like 90s hits, can be queued.",
        "A key part is refactoring the current iTunes integration to Spotify’s API to improve functionality and stability.",
        "I’m also implementing a company-specific setup where bars can link their Spotify account through the website to grant the system permission to manage the queue using an API token."
      ],
      "url": "Not available yet"
    }
  ]
}
