{
  "title": "Startups jag har hjälpt utveckla",
  "companies": [
    {
      "id": "sociala-verktygsladan",
      "name": "Sociala verktygslådan",
      "title": "Konsult inom användarupplevelse",
      "duration": "Juni 2025 – Pågående",
      "shortDescription": "Förbättring av användarupplevelsen på en informell hemsida riktad till socionomer, familjer och barn.",
      "fullDescription": [
        "Ansvarar för att förbättra användarvänligheten och tillgängligheten på företagets informella hemsida.",
        "Fokuserar på att skapa en intuitiv och engagerande webbupplevelse som får besökare att stanna längre, vilket även bidrar positivt till SEO.",
        "Hemsidan är anpassad för både professionella användare (socionomer) och icke-professionella användare (familjer och barn).",
        "Har arbetat med att strukturera och anpassa navigationen och tonaliteten för att passa målgruppens behov.",
        "Vid tid över arbetar jag även med att förbättra SEO-strategin för att öka synligheten i sökmotorer.",
        "Uppdraget är begränsat till hemsidan och omfattar inte företagets app eller huvudprodukt."
      ],
      "url": "https://socialaverktygsladan.se/"
    },
    {
      "id": "Hantverkskollen",
      "name": "Hantverkskollen",
      "title": "Konsult",
      "duration": "Juni 2025 – Pågående",
      "shortDescription": "Stöttar research och idéutveckling av digitala verktyg för hantverksbranschen.",
      "fullDescription": [
        "Min roll som konsult innebär att jag hjälper företaget att undersöka och förstå hantverkares behov i Sverige.",
        "Just nu befinner vi oss i en tidig fas där fokus ligger på marknadsundersökning och att identifiera problemområden inom branschen.",
        "Troligtvis kommer resultatet att bli ett boknings- eller kommunikationssystem mellan kund och hantverkare, då många ogillar att svara i telefon när de jobbar.",
        "Exakt vad produkten blir är ännu inte bestämt – det styrs av den feedback och de insikter vi samlar in under processen.",
        "Min insats anpassas utifrån detta, men jag bidrar både tekniskt och strategiskt för att utveckla en relevant digital lösning."
      ],
      "url": "https://hantverkskollen.se/"
    },
    {
      "id": "Juke",
      "name": "Juke",
      "title": "Fullstack Utvecklare",
      "duration": "Juni 2025 - Pågående",
      "shortDescription": "Utveckling av ett system för att låta kunder köa låtar via en webbapplikation på pubar och barer.",
      "fullDescription": [
        "Jag ansvarar för att vidareutveckla en produkt som kopplar webbapplikationen till barernas Spotify-konton för att möjliggöra låtköning direkt i barens musiksystem.",
        "Systemet ska öka försäljning och kundernas tid på plats genom att låta dem påverka musikutbudet via sin mobil eller dator.",
        "Barerna får möjlighet att sätta filter och kontrollera vilken musik som spelas, till exempel genom temadagar där endast viss musik kan köas, som 90-talets hits.",
        "En viktig del är att refaktorera nuvarande integration från iTunes till Spotifys API för att få bättre funktionalitet och stabilitet.",
        "Jag implementerar också ett företagsspecifikt upplägg där barerna kan länka sitt Spotify-konto via hemsidan för att ge systemet behörighet att styra låtköningen via API-token."
      ],
      "url": "Inte tillgängligt än"
    }
  ]
}
